web application/www/dev/controllers/ItemController.php

    public function actionIndex($page = 1, $pageSize = 20)
    {
        $keyword = Yii::$app->request->get("keyword");
        $query = Item::find();
        if ($keyword) {
            $query->where(["like", "title", $keyword]);
        }

        $pagination = new Pagination();
        $pagination->pageSize = $pageSize;
        $pagination->totalCount = $query->count();
---
SELECT COUNT(*) FROM `item` WHERE `title` LIKE '%history%'